In [1]:
import pandas as pd

data = pd.read_csv('/Users/sujeetmohanty/Documents/Anaconda Projects/RawData.csv')

data

    Name  Age  Income
0  David   24   10000
1   Alyx   34   24000
2   John    2  300000
3  Rohit   12   56000
4    Cam   67    4500

In [2]:
col_list = ["Name", "Age"]
df = pd.read_csv("RawData.csv", usecols=col_list)

print(df["Name"])

0    David
1     Alyx
2     John
3    Rohit
4      Cam
Name: Name, dtype: object

In [3]:
col_list = ["Name", "Age"]
df = pd.read_csv("RawData.csv", usecols=col_list)

print(df["Name"])

0    David
1     Alyx
2     John
3    Rohit
4      Cam
Name: Name, dtype: object